<a href="https://colab.research.google.com/github/08vivek08/data-science/blob/main/2_pandas_basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import json
import numpy as np

In [ ]:
df=pd.DataFrame()

In [ ]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[7,8,2,4],[12,41,2,1],[8,5,14,25]],columns=['A','B','C','D'])

In [ ]:
df1.head(3)

   A  B  C  D
0  1  2  3  4
1  5  6  7  8
2  7  8  2  4

In [ ]:
df1.tail(4)

    A   B   C   D
1   5   6   7   8
2   7   8   2   4
3  12  41   2   1
4   8   5  14  25

In [ ]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   7   8   2   4
3  12  41   2   1
4   8   5  14  25

In [ ]:
df1.shape

(5, 4)

In [ ]:
df1.iloc[0:2,1:3]

   B  C
0  2  3
1  6  7

In [ ]:
from google.colab import files 
myfile=files.upload()

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
df=pd.read_csv('sample_data/california_housing_test.csv')

In [ ]:
df

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In [ ]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [ ]:
print(df['longitude'].dtype)

float64

In [ ]:
df1.head()

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   7   8   2   4
3  12  41   2   1
4   8   5  14  25

In [ ]:
df1.to_csv('export.csv', index=False)

In [ ]:
df2=pd.DataFrame([[11,8,31,41],[51,41,17,18],[17,5,12,41],[121,6,21,11],[18,2,141,125]],columns=['W','X','Y','Z'])

In [ ]:
df2.head()

     W   X    Y    Z
0   11   8   31   41
1   51  41   17   18
2   17   5   12   41
3  121   6   21   11
4   18   2  141  125

In [ ]:
df3=pd.merge(df1,df2,right_on='X',left_on='B')

In [ ]:
df3

    A   B   C   D    W   X    Y    Z
0   1   2   3   4   18   2  141  125
1   5   6   7   8  121   6   21   11
2   7   8   2   4   11   8   31   41
3  12  41   2   1   51  41   17   18
4   8   5  14  25   17   5   12   41

In [ ]:
json_data='{"a":1,"b":2,"c":3}'

In [ ]:
x=json.loads(json_data)

In [ ]:
x

{'a': 1, 'b': 2, 'c': 3}

In [ ]:
x['c']

3

In [ ]:
x['a']

1

In [ ]:
with open('jsondata.json','w') as f:
  json.dump(x,f)

In [ ]:
y = pd.read_json("https://api.coindesk.com/v1/bpi/currentprice.json")

In [ ]:
y

                                 time  ...                                                bpi
updated     Dec 15, 2020 16:32:00 UTC  ...                                                NaN
updatedISO  2020-12-15T16:32:00+00:00  ...                                                NaN
updateduk   Dec 15, 2020 at 16:32 GMT  ...                                                NaN
USD                               NaN  ...  {'code': 'USD', 'symbol': '&#36;', 'rate': '19...
GBP                               NaN  ...  {'code': 'GBP', 'symbol': '&pound;', 'rate': '...
EUR                               NaN  ...  {'code': 'EUR', 'symbol': '&euro;', 'rate': '1...

[6 rows x 4 columns]

In [ ]:
y['bpi']

updated                                                     NaN
updatedISO                                                  NaN
updateduk                                                   NaN
USD           {'code': 'USD', 'symbol': '&#36;', 'rate': '19...
GBP           {'code': 'GBP', 'symbol': '&pound;', 'rate': '...
EUR           {'code': 'EUR', 'symbol': '&euro;', 'rate': '1...
Name: bpi, dtype: object

In [ ]:
y['bpi']['USD']

{'code': 'USD',
 'description': 'United States Dollar',
 'rate': '19,406.6867',
 'rate_float': 19406.6867,
 'symbol': '&#36;'}

In [ ]:
y['bpi']['USD']['rate']

'19,406.6867'

In [ ]:
z = pd.read_json("jsondata.json",typ='series')

In [ ]:
z

a    1
b    2
c    3
dtype: int64

In [ ]:
z['a']

1

In [ ]:
w = pd.read_json("https://dog.ceo/api/breeds/image/random",typ='series')

In [ ]:
w

message    https://images.dog.ceo/breeds/entlebucher/n021...
status                                               success
dtype: object